export const faqDB = [
    {
        question: "บัญชีกลางคืออะไร",
        answer: "ตัวกลางรับชำระเงินระหว่างผู้ซื้อกับผู้ขาย ป้องกันมิจฉาชีพหลอกโอนเงินแล้วไม่ส่งของ โดยบริษัทกลางหลักประกันออนไลน์จำกัด",
    },
    {
        question: "หลักประกันออนไลน์คืออะไร",
        answer: "เงินที่ผู้ขายใช้เป็นสิ่งค้ำประกันว่าสินค้า และ บริการที่ส่งมอบให้ผู้ซื้อจะสมบรูณ์ ไม่มีปัญหาในระยะเวลาที่รับประกัน",
    },
    {
        question: "บัญชีกลางเหมาะกับใคร",
        answer: "ผู้ซื้อที่ไม่อยากถูกโกง ผู้ซื้อที่ต้องการซื้อสินค้าจากผู้ขายที่ไม่มั่นใจว่าจะได้สินค้า ผู้ขายที่ลงขายสินค้าเองผ่านช่องทางต่างๆ ไม่ได้วางขายบนแฟลตฟอร์มออนไลน์ ผู้ขายที่ต้องการความน่าเชื่อถือว่าส่งของจริง ไม่โกงแน่นอน ผู้ขายที่ลูกค้าไม่กล้าซื้อเพราะกลัวถูกโกง ผู้ขายที่พร้อมจะเดินไปกับบัญขีกลาง สร้างโอกาา สร้างความน่าเชื่อถือ",
    },
    {
        question: "หลักประกันออนไลน์ที่เหมาะกับทุกคน และธุรกิจ",
        answer: "ค่าบริการ 15 บาท / รายการสำหรับบัญชีกลาง ค่าบริการหลักประกันออนไลน์ฉบับละ 300 บาท ไม่กำหนดระยะเวเลาถอน",
    },
]