export const category = [
    { 
        description: "ข้อมูลรายละเอียดเกี่ยวกับตัวคุณ หรือข้อมูลที่ใข้ในการะบุและยืยันตัวตนของคุณ เช่น ชื่อ-นามสกุล วันเดือนปีเกิด ช้อมูลบัตรประจำตัวประชาชน ลายมือชื่อ ข้อมูลภาพจำลองใบหน้า" 
    },
    { 
        description: "ข้อมูลสถานที่หรือวิธีการติดต่อ เช่น หมายเลขโทรศัพท์ อีเมลล์ ที่อยู่"
    },
    { 
        description: "ข้อมูลที่เกี่ยวกับการรักษาความปลอดภัย เช่น ข้อมูลจากกล้องวงจรปิด"
    },
    { 
        description: "ข้อมูลส่วนบุลคลอื่นๆ ตามที่ประกาศหรือกฎหมายที่เกี่ยวข้องกำหนด" 
    },
]

export const chance = [
    { 
        description: "ผ่านสาขาของบัญชีกลาง หรือช่องทางการส่งเสริมการขายและการตลาด" 
    },
    { 
        description: "ผ่านช่องทางออนไลน์ เช่น แอพพลิเคชั่นบนโทรศัพท์มือถือ เว็บไซต์ หรือแพลตฟอร์มเครือข่ายสังคมออนไลน์ เช่น แอพพลิเคชั่น LINE และ Facebook" 
    },
    { 
        description: "ส่วนช่องทางอื่นๆ เช่น ข้อมูลสาธารณะ หน่วยงานภาครัฐ บริษัทในกลุ่มธุรกิจทางการเงิน หรือพันธมิตรทางธุรกิจของบัญชีกลาง" 
    },
]

export const db = [
    {
        description: "เพื่อให้บัญชีกลาง สามารถให้บริการแก่คุณได้ เช่น เพื่อพิสูจน์และยืนยันตัวตนของคุณก่อนใช้งานผลิตภัณฑ์/บริการ หรือก่อนการทำธรุกรรมกับบัญชีกลาง หรือในการรับเรื่องร้องเรียนจากคุณ"
    },
    {
        description: "เพื่อใช้ในการบริหารงานลูกค้าสัมพันธ์และการติดต่อระหว่างบัญชีกลางกับคุณ เช่น เพื่อแจ้งผลการสมัครใช้บริการของคุณ เพื่อขอข้อมูลเพิ่มเติม เพื่อนำเสนอผลิตภัณฑ์บริการให้คุณได้รับประสบการณ์ที่ดีที่สุด"
    },
    {
        description: "เพื่อประโยชน์ในการปรับปรุงคุณภาพการบริการ เช่น เพื่อการวิเคราะห์และประเมินความพึงพอใจของคุณที่มีต่อบริการของกลุ่มบัญชีกลาง หรือเพื่อวิเคราะห์ข้อมูลสำหรับการพัฒนาผลิตภัณฑ์/บริการให้กับคุณได้รับการณ์ที่ดีที่สุด"
    },
    {
        description: "เพื่อการปฎิบัติตามกฎหมายที่ใช้บังคับกับบัญชีกลาง"
    },
    {
        description: "เพื่อให้บัญชีกลางติดต่อประสานงานดำเนินการธุรกรรมที่มีกับพันธมิตรทางธุรกิจที่คุณสังกัด"
    },
]

export const reveal = [
    {
        description: "ผู้ประมวลผลข้อมูลส่วนบุุคคล ผู้ให้บริการภายนอก ตัวแทนของบัญชีกลางผู้รับจ้างงานช่วงต่อ พันธมิตรทางธุรกิจที่ออกผลิตภัณฑ์ร่วมกันในลักษณะ co-brand รวมถึงพันธมิตรทางธุรกิจอื่นๆ"
    },
    {
        description: "สถาบันการเงินอื่นและผู้ให้บริการระบบการชำระเงินอื่น เพื่อให้บริการที่เกี่ยวกับการโอนเงินระหว่างบัญชีกลางกรณีที่คุณขอใช้บริการธุรกรรมระหว่างประเทศ บัญชีกลางอาจเปิดเผยข้อมูลของคุณให้แก่สถาบันทางการเงินต่างประเทศ ตามตำขอและข้อมูลที่คุณให้ไว้กับบัญชีกลาง"
    },
    {
        description: "หน่วยงานของรัฐหรือหน่วยงานที่มีอำนาจตามกฎหมาย เช่น ธนาคารแห่งประเทศไทย กรมการปกครอง สำนักงานป้องกันและปราบปรามการฟอกเงิน สำนักงานคณะกรรมการกำกับและส่งเสริมการประกอบธุรกิจประกันภัย"
    },
]

export const law = [
    { description: "สิทธิในการเข้าถึงข้อมูลส่วนบุคคล" },
    { description: "สิทธิในการแก้ไขข้อมูลส่วนบุคคลได้ถูกต้อง" },
    { description: "สิทธิในการลบหรือทำลายข้อมูลส่วนบุุคคล" },
    { description: "สิทธิในการระงับการใช้ข้อมูลส่วนบุคคล" },
    { description: "สิทธิในการคัดค้านการเก็บรวบรวมใช้ หรือเปิดเผยข้อมูลส่วนบุคคล" },
    { description: "สิทธิในการเพิกถอนความยินยอมการเก็บรวมใช้หรือเปิดเผยข้อมูลส่วนบุคคล" },
    { description: "สิทธิในการขอรับ ส่ง หรือโอนข้อมูลส่วนบุคคล" },
    { description: "สิทธิในการร้องเรียนในกรณีที่คุณเห็นว่าบัญชีกลางมิได้ปฎิบัติตามกฎหมายเกี่ยวกับการคุ้มครองข้อมูลส่วนบุคคล" },
]