export const Definition = [
    {  
        id: "1.1.",
        name: "เนื้อหา",
        description: "ข้อมูลต่างๆ เช่น ข้อความ เสียง เพลง รูปภาพ วิดีโอ ซอฟแวร์ โปรแกรม รหัสคอมพิวเตอร์ และข้อมูลอื่นๆ" 
    },
    {
        id: "1.2.",
        name: "เนื้อหาหลัก",
        description: "เนื้อหาที่เราสามารถเข้าถึงได้ผ่านทางบริการฯ" 
    },
    {
        id: "1.3.",
        name: "เนื้อหาจากผู้ใช้",
        description: "เนื้อหาที่ผู้ใช้ได้ส่ง ส่งผ่าน หรืออัปโหลดบนระบบการให้บริการฯ" 
    },
    {
        id: "1.4.",
        name: "เหรียญ",
        description: "ตราสารการชำระหนี้แบบเติมเงินหรือสิ่งอื่นใดที่มีความคล้ายคลึงกัน ซึ่งผู้ใช้สามารถใช้ตราสารดังกล่าวแลกเปลี่ยนกับเนื้อหาและบริการค่างๆ โดยเสียค่าตอบแทนซึ่ง แอพพลิเคชั่น บัญชีกลางเป็นผู้ให้บริการ"
    },
    {
        id: "1.5.",
        name: "ข้อกำหนดและเงื่อนไขฯ เพิ่มเติม",
        description: "ข้อกำหนดและเงื่อนไขอื่นใดซึ่งแตกต่างหากจากข้อกำหนกและเงื่อนไขฯ ฉบับนี้ และเกี่ยวข้องกับบริการฯ ซึ่งเผยแพร่หรืออัปโหลดโดย แอพพลิเคชั่นบัญชีกลาง ภายใต้ชื่อ 'ข้อตกลง' แนวทางปฏิบัติ 'นโยบาย' หรือภายใต้ชื่ออื่นๆที่มีความหมายคล้ายคลึงกัน"
    },
]

export const Agreement = [
    {
        id: "2.1",
        description: "บริษัทขอสงวนสิทธิ์ที่จะเปลี่ยนแปลง แก้ไข เพิกถอน หยุด ระงับ ยับยั้งเงื่อนไขหรือการใช้งานได้ตามความเหมาะสมและตามการเปลี่ยนแปลงอื่นๆ ซึ่งถูกประกาศให้ทราบบนแอพพลิเคชั่น",
    },
    {
        id: "2.2",
        description: "ผู้ใช้งานควรเข้าไปเยี่ยมชมแอพพลิเคชั่นเป็นระยะและตรวจสอบเนื้อหาข้อตกลงที่มีการเปลี่ยนแปลงและได้ประกาศไว้แล้ว หากผู้ใช้งานได้มีการเข้าใช้งานหลังจากมีการประกาศเปลี่ยนแปลงไปแล้ว ถือว่าท่านได้ยอมรับและเห็นด้วยในการเปลี่ยนแปลงในเนื้อหานั้น และทางบริษัทสามารถเพิกเฉยและจะไม่รับผิดชอบต่อความเสียหายใดๆ หรือผลประโยชน์ต่างๆของท่าน อันเกิดจากการไม่ทราบเนื้อหาประกาศนั้นๆ",
    },
    {
        id: "2.3",
        description: "ผู้ใช้งานจะต้องลงทะเบียนในการใช้งานแอพพลิเคชั่น โดยกรอกข้อมูลทั้งหมดตามความเป็นจริง",
    },
    {
        id: "2.4",
        description: "แอพพลิเคชั่นจะใช้งานภายใต้เงื่อนไขตามกฎหมายไทย หรือกฎหมายระหว่างประเทศที่ใช้บังคับและเป็ยที่ยอมรับของนานาประเทศ หรือตามนโยบายของรัฐ เพื่อให้แอพพลิเคชั่นที่บริษัทฯ ได้จัดทำขึ้นถูกต้องตามกฎหมายหรือไม่ขัดกับนโยบายของรัฐ",
    },
    {
        id: "2.5",
        description: "",
    },
    {
        id: "2.6",
        description: "",
    },
    {
        id: "2.7",
        description: "",
    },
    {
        id: "2.8",
        description: "",
    },
    {
        id: "2.9",
        description: "",
    },
    {
        id: "2.10",
        description: "",
    },
]