export const Definition = [
    {
        id: "1.1.",
        name: "เนื้อหา",
        description: "ข้อมูลต่างๆ เช่น ข้อความ เสียง เพลง รูปภาพ วิดีโอ ซอฟแวร์ โปรแกรม รหัสคอมพิวเตอร์ และข้อมูลอื่นๆ"
    },
    {
        id: "1.2.",
        name: "เนื้อหาหลัก",
        description: "เนื้อหาที่เราสามารถเข้าถึงได้ผ่านทางบริการฯ"
    },
    {
        id: "1.3.",
        name: "เนื้อหาจากผู้ใช้",
        description: "เนื้อหาที่ผู้ใช้ได้ส่ง ส่งผ่าน หรืออัปโหลดบนระบบการให้บริการฯ"
    },
    {
        id: "1.4.",
        name: "เหรียญ",
        description: "ตราสารการชำระหนี้แบบเติมเงินหรือสิ่งอื่นใดที่มีความคล้ายคลึงกัน ซึ่งผู้ใช้สามารถใช้ตราสารดังกล่าวแลกเปลี่ยนกับเนื้อหาและบริการค่างๆ โดยเสียค่าตอบแทนซึ่ง แอพพลิเคชั่น บัญชีกลางเป็นผู้ให้บริการ"
    },
    {
        id: "1.5.",
        name: "ข้อกำหนดและเงื่อนไขฯ เพิ่มเติม",
        description: "ข้อกำหนดและเงื่อนไขอื่นใดซึ่งแตกต่างหากจากข้อกำหนกและเงื่อนไขฯ ฉบับนี้ และเกี่ยวข้องกับบริการฯ ซึ่งเผยแพร่หรืออัปโหลดโดย แอพพลิเคชั่นบัญชีกลาง ภายใต้ชื่อ 'ข้อตกลง' แนวทางปฏิบัติ 'นโยบาย' หรือภายใต้ชื่ออื่นๆที่มีความหมายคล้ายคลึงกัน"
    },
]

export const Agreement = [
    {
        id: "2.1",
        description: "บริษัทขอสงวนสิทธิ์ที่จะเปลี่ยนแปลง แก้ไข เพิกถอน หยุด ระงับ ยับยั้งเงื่อนไขหรือการใช้งานได้ตามความเหมาะสมและตามการเปลี่ยนแปลงอื่นๆ ซึ่งถูกประกาศให้ทราบบนแอพพลิเคชั่น",
    },
    {
        id: "2.2",
        description: "ผู้ใช้งานควรเข้าไปเยี่ยมชมแอพพลิเคชั่นเป็นระยะและตรวจสอบเนื้อหาข้อตกลงที่มีการเปลี่ยนแปลงและได้ประกาศไว้แล้ว หากผู้ใช้งานได้มีการเข้าใช้งานหลังจากมีการประกาศเปลี่ยนแปลงไปแล้ว ถือว่าท่านได้ยอมรับและเห็นด้วยในการเปลี่ยนแปลงในเนื้อหานั้น และทางบริษัทสามารถเพิกเฉยและจะไม่รับผิดชอบต่อความเสียหายใดๆ หรือผลประโยชน์ต่างๆของท่าน อันเกิดจากการไม่ทราบเนื้อหาประกาศนั้นๆ",
    },
    {
        id: "2.3",
        description: "ผู้ใช้งานจะต้องลงทะเบียนในการใช้งานแอพพลิเคชั่น โดยกรอกข้อมูลทั้งหมดตามความเป็นจริง",
    },
    {
        id: "2.4",
        description: "แอพพลิเคชั่นจะใช้งานภายใต้เงื่อนไขตามกฎหมายไทย หรือกฎหมายระหว่างประเทศที่ใช้บังคับและเป็ยที่ยอมรับของนานาประเทศ หรือตามนโยบายของรัฐ เพื่อให้แอพพลิเคชั่นที่บริษัทฯ ได้จัดทำขึ้นถูกต้องตามกฎหมายหรือไม่ขัดกับนโยบายของรัฐ",
    },
    {
        id: "2.5",
        description: "กรณีที่บริษัทจำเป็นต้อวเพิ่มเนื้อหาการใช้งานแอพพลิเคชั่น หรือเพิ่มความจำเป็นในการบริหารแอพพลิเคชั่น ผู้ใช้งานยินยอมให้มีสิทะิเปลี่ยนแปลงได้ ทั้งโดยการอัพเดตออนไลน์และออฟไลน์",
    },
    {
        id: "2.6",
        description: "หากแอพพลิเคชั่นมีการแจ้งข้อมูลข่าวสาร การเตือนสิทธิประโยชน์ การอัพเดตในส่วนต่างๆปรากฎขึ้นบนคอมพิวเตอร์ หรือโทรศัพท์ของท่าน ให้ถือว่ายอมรับการแจ้งดังกล่าวโดยไม่มีเงื่อนไข",
    },
    {
        id: "2.7",
        description: "บริษัทฯ จะไม่รับผิดชอบจากการที่ท่านไม่สามารถเข้าสู่บัญชีผู้ใช้งานอันเนื่องมาจากความล่าช้าของระบบการเชื่อมต่ออินเตอร์เน็ต ซึ่งอาจเกิดความล่าช้า หรือไม่สามารถเข้าได้ในบางขณะ",
    },
    {
        id: "2.8",
        description: "ผู้ใช้ทุกรายจะต้องใช้บริการฯ ตามข้อกำหนดชื่อระบุไว้ในข้อกำหนดและเงื่อนไขฯ ฉบับนี้ โดยผู้ใช้จะไม่สามารถใช้บริการฯ ได้เว้นเสียแต่ผู้ใช้ได้ตกลงยอมรับข้อกำหนด และเงื่อนฯฉบับนี้แล้ว",
    },
    {
        id: "2.9",
        description: "ผู้ใช้ซึ่งเป็นผู้เยาว์จะสามารถใช้บริการฯ ได้ก็ต่อเมื่อได้รับความยินยอมล่วงหน้าจากบิดามารดา หรือผู้แทนโดยชอบกฎหมายเท่านั้น นอกจากนี้หากผู้บริการฯ ในนามหรือเพื่อวัตถุประสงค์ขององค์กรธุรกิจใด ให้ถือว่าองค์กรธุรกิจดังกล่าวได้ตกลงยอมรับข้อกำหนดและเงื่อนไขฯ ฉบับนี้แล้วล่วงหน้า",
    },
    {
        id: "2.10",
        description: "หากมีข้อกำหนดและเงื่อนไขฯ เพิ่มเติมใดๆ ซึ่งเกี่ยวข้องกับการให้บริการฯ ผู้ใช้จะต้องปฎิบัติตามข้อกำหนดและเงื่อนไขฯ เพิ่มเติมดังกล่าวเช่นเดียวกับข้อกำหนดและเงื่อนไขฯ ในการใช้งานฉบับนี้",
    },
]

export const Apps = [
    {
        id: "4.1.",
        description: "เมื่อใช้บริการฯ ผู้ใช้อาจมีความจำเป็นต้องลงทะเบียนการใช้บริการฯ ด้วยข้อมูลบางประการทั้งนี้ ผู้ใช้ต้องให้ข้อมูลที่เป็นความจริง ถูกต้อง ครบถ้วนและมีหน้าที่ต้องปรับปรุงและแก้ไขข้อมูลดังกล่าวให้เป็นปัจจุบันอยู่เสมอ"
    },
    {
        id: "4.2.",
        description: "ในกรณีที่ผู้ใช้ลงทะเบียนข้อมูลการยืนยันตัวตนใดๆ (Authentication information) เมื่อใช้บริการฯ ผู้ใช้ต้องใช้ความระมัดระวังในการจัดการข้อมูลดังกล่าวด้วยความรับผิดชอบของตน เพื่อให้เป็นที่แน่ใจว่าข้อมูลดังกล่าวจะไม่ถูกนำไปใช้ในลักษณะที่ไม่ชอบด้วยกฎหมายทั้งนี้ แอพพลิเคชั่นบัญชีกลาง อาจถือว่ากิจกรรมใดๆ ซึ่งดำเนินการโดยการใช้ข้อมูลการรับรองตัวตนดังกล่าว เสมือนเป็นกิจกรรมที่ผู้เป็นเจ้าของข้อมูลได้ดำเนินการด้วยตนเองทั้งสิ้น"
    },
    {
        id: "4.3.",
        description: "ผู้ใช้ซึ่งลงทะเบียนใช้บริการฯ สามารถลบบัญชีของตนและยกเลิกการใช้บริการฯ ได้ไม่ว่าในเวลาใด"
    },
    {
        id: "4.4.",
        description: "แอพพลิเคชั่นบัญชีกลางขอสงวนสิทธิในการลบบัญชีใดๆ ซึ่งไม่มีการเปิดใช้งานเป็นเวลากว่าหนึ่ง(1)ปี หรือนานกว่านับแต่วันที่มีการเปิดใช้งานบัญชีดังกล่าวครั้งล่าสุด ทั้งนี้โดยไม่ต้องบอกกล่าวล่วงหน้าใดๆ แก้ผู้ใช้บัญดังกล่าว"
    },
    {
        id: "4.5.",
        description: "สิทธิใดๆของผู้ใช้บริการอาจสิ้นสุดลงเมื่อบัญชีของผู้ใช้ดังกล่าวถูกลบไม่ว่าด้วยเหตุผลประการใดๆทั้งนี้ บัญชีการใช้บริการฯจะไม่สามารถกู้คืนได้ถึงแม้ว่าผู้ใช้บริการฯ จะลบบัญชีของตนโดยไม่ได้ตั้งใจก็ตาม"
    },
    {
        id: "4.6.",
        description: "บัญชีแต่ละบัญชีในการใช้บริการฯนั้น มิไว้เพื่อการใช้งานเฉพาะบุคคลและเป็นของเจ้าของบัญชีนั้นแต่เพียงผู้เดียว ผู้ใช้ไม่สามารถโอน ให้ยืน หรือจำหน่ายสิทธิในการใช้บัญชีของตนแก้บุคคลภายนอก ขณะเดียวกันบุคคลภายนอกก็ไม่สามารถรับช่วงสิทธิหรือสืบทอดบัญชีดังกล่าวได้เช่นกัน"
    },
]

export const Users = [
    {
        id: "5.1.",
        description: "แอพพลิเคชั่นบัญชีกลางให้ความสำคัญแก่ความเป็นส่วนตัวของผู้ใช้บริการฯ เป็นลำดับแรก",
    },
    {
        id: "5.2.",
        description: "แอพพลิเคชั่นบัญีชีกลางจะคุ้มครองความเป็นส่วนตัว และข้อมูลส่วนบุคคลของผู้ใช้บริการฯอย่างเหมาะสมตาม 'นโยบายของแอพพลิเคชั่น' บัญชีกลางว่าด้วยการคุ้มครองข้อมูลส่วนบุคคล",
    },
    {
        id: "5.3.",
        description: "แอพพลิเคชั่นบัญกลางสัญญาที่จะใช้ความระมัดระวัง และความเอาใส่ใจอย่างสูงสุดกับมาตรการรักษาความปลอดภัย เพืื่อให้แน่ใจว่ามีการจัดการข้อมูลใดๆ ซึ่งเก็บราบรวมจากผู้ใช้บริการฯ อย่างเหมาะสมและปลอดภัย",
    }
]

export const Services = [
    {
        id: "6.1.",
        description: "ผู้ใช้จะเป็นผู้รับผิดชอบจัดหาเครื่องคอมพิวเตอร์ อุปกรณ์สื่อสารเคลื่อนที่ สมาร์ทโฟน อุปกรณ์สื่อสารอื่นๆ ระบบปฎิบัติการ วิธีการเชื่อมต่อสื่อสารและกระแสไฟฟ้า ฯลฯ ซึ่งจำเป็นต่การใช้บริการฯ ทั้งนี้ผู้ใช้เป็นผู้ออกค่าใช้จ่ายเองทั้งสิ้น",
    },
    {
        id: "6.2.",
        description: "แอพพลิเคชั่นบัญชีกลางขอสงวนสิทธิในการจำกัดการเข้าถึงการใช้บริการฯทั้งหมด หรือแต่บางส่วนของผู้ใช้บริการฯ การสงวนสิทธิดังกล่าวขึ้นอยู่กับเงื่อนไขที่แอพพลิเคชั่นบัญชีกลางเห็นสมควร เช่น อายุ และการระบุตนตนของผู้ใช้บริการฯ การลงทะเบียน สถานภาพ และองค์ประกอบอื่นใดที่มีความคล้ายคลึงกัน",
    },
    {
        id: "6.3.",
        description: "แอพพลิเคชั่นบัญชีกลางขอสงวนสิทธิในการแก้ไขหรือเปลี่ยนแปลงข้อกำหนดและเงื่อนไชฯ ในการใช้บริการทั้งหมดหรือแต่บางส่วนไม่ว่าในเวลาใดตามที่แอพพลิเคชั่นบัญชีกลางเห็นสมควร ทั้งนี้โดยไม่ต้องบอกกล่าวล่วงหน้าแก้ผู้ใช้",
    },
    {
        id: "6.4.",
        description: "แอพพลิเคชั่นบัญชีกลางอาจหยุดการให้บริการฯหั้งหมด หรือแต่บางส่วนโดยไม่ต้องบอกกล่าวล่วงหน้าแก้ผู้ใช้ในกรณีดังต่อไปนี้",
    },
    {
        id: "(1)",
        description: "เมื่อทำการบำรุงรักษาหรือซ่อมแซมระบบ",
    },
    {
        id: "(2)",
        description: "เมื่อทำการบำรุงรักษาหรือซ่อมแซมระบบ",
    },
    {
        id: "(3)",
        description: "เมื่อไม่สามารถให้บริการได้เนื่องจากเหตุสุดวิสัยบางประการ เช่น อุบัติเหตุ(ไฟดับไฟไหม้ ฯลฯ) ปรากฎการธรรมชาติ สงคราม การจราจล และข้อพิพาทอื่นๆ",
    },
    {
        id: "(4)",
        description: "เพื่อรักษาความปลอดภัยของผู้ใช้ หรือบุคคลภายนอก หรือเพื่อดำเนินภารกิจอันเป็นประโยชน์ต่อสาธารณะะในกรณีฉุกเฉิน",
    },
    {
        id: "(5)",
        description: "เมื่อแอพพลิเคชั่นบัญชีกลาง เห็นว่ามีความจำเป็นและเป็ฯการสมควรนอกจากกรณีที่ได้ระบุไว้ในข้อ (1) ถึง (4) ข้างต้น",
    },
]

export const Content = [
    {
        id: "9.1.",
        description: "แอพพลิเคชั่นบัญชีกลางอนุญาติให้ผู้ใช้ใช้บริการฯ เนื้อหาหลักที่จัดให้เพื่อวัตถุประสงค์ในการใช้บริการฯของผู้ใช้ โดยไม่จำกัดจำนวนผู้ใช้ อย่างไรก็ตามผู้ใช้ไม่สามารถส่งหรือโอน อนุญาติช่วง หรืออนุญาติสิทธิแก้บุคคลภายนอกได้ (์non-transferable, non-re-licensable, non-exclusive license)",
    },
    {
        id: "9.2.",
        description: "ผู้ใช้จะต้องปฎิบัติตามเงื่อนไชที่มีผลบังคับใช้ เมื่อใช้เนื้อหาหลักซึ่งอยู่ภายใต้ข้อกำหนดและเงื่อนไขฯฉบับนี้ เช่น ค่าธรรมเนียมเพิ่มเติม ระยะเวลาในการใช้บริการฯ และเงื่อนไขอื่นใด ซึ่งมีความคล้ายคลึงกัน ถึงแม้ว่าจะมีถ้อยคำดังต่อไปนี้ปรากฎบนหน้าจอในการใช้บริการฯ เช่น 'การซื้อ' 'การขาย' และถ้อยคำอื่นๆ ซึ่งมีความคล้ายคลึงกันในกรณีนี้แอพพลิเคชั่นบัญชีกลาง จะยังคงเป็นเจ้าของสิทธิในทรัพย์สินทางปัญญารวมถึงสิทธิอื่นๆทั้งหมดในเนื้อหาหลักที่แอพพลิเคชั่นบัญชีกลาง เป็นผู้ให้บริการแก้ผู้ใช้ ซึ่งสิทธิดังกล่าวจะไม่ถูกโอนไปให้แก่ผู้ใช้แต่อย่างใด ผู้ใช้งานจะได้รับสิทธิในการใช้งานตามที่ได้ระบุไว้ข้างต้นเท่านั้น",
    },
    {
        id: "9.3.",
        description: "ผู้ใช้จะต้องไม่ใช้เนื้อหาหลักเกินจากขอบวัตถุประสงค์ของการใช้บริการฯ (ซึ่งรวมถึงแต่ไม่จำกัดเพียงการทำสำเนา การส่ง การทำซ้ำ และการแก้ไขเปลี่ยนแปลง)",
    },
    {
        id: "9.4.",
        description: "ในกรณีที่ผู้ใช้ต้องการที่จะาำรองเนื้อหาจากผู้ใช้ (Back-up) ไม่ว่าทั้งหมดหรือเพียงบางส่วน ผู้ใช้จะต้องดำเนินการดังกล่าวด้วยตนเอง แอพพลิเคชั่นบัญชีกลางไม่มีหน้าที่และภาระในการสำรองเนื้อหาจากผู้ใช้แต่อย่างใด",
    },
    {
        id: "9.5.",
        description: "บริการฯอาจรวมถึงกระบวนการการทำงาน (ฟังก์ชั่น) ต่างๆ ซึ่งผู้ใช้หลายคนสามารถที่จะแก้ไขเนื้อหาได้ (โพสต์ ตรวจสอบความถูกต้อง และการลบเป็นต้น) ในกรณีดังกล่าวผู้ใช้ซึ่งโพสต์เนื้อหาดังกล่าวจะต้องอนุญาติให้ผู้ใช้รายอื่นแก้ไขเนื้อหาของตนได้",
    },
    {
        id: "9.6.",
        description: "ผู้ใช้จะยังคงมีสิทธิที่เกี่ยวกับเนื้อหาจากผู้ใช้อยู่เช่นเดิม และ แอปพลิเคชัน บัญชีกลางจะไม่ได้มาซึ่งสิทธิใดๆ ในเนื้อหาดังกล่าว อย่างไรก็ตามผู้ใช้ซึ่งโพสต์เนื้อหาที่มีความเป็นสาธารณะสามารถเข้าถึงได้เป็นการทั่วไป (ไม่จำกัดเพียง 'เพื่อน' ของผู้ใช้เท่านั้น) ให้ถือว่าผู้ใช้ซึ่งโพสต์เนื้อหาดังกล่าวได้รับสิทธิต่างๆ จาก แอปพลิเคชัน บัญชีกลางให้สามารถใช้เนื้อหาดังกล่าวเพื่อให้บริการและ/หรือเพื่อวัตถุประสงค์ในการส่งเสริมการตลาดได้ (สิทธิต่างๆ ในที่นี้รวมถึง สิทธิในการแก้ไขเนื้อหาในขอบเขตที่ แอปพลิเคชัน บัญชีกลางเห็นว่ามีความจำเป็นและเหมาะสม เช่น การใช้อักษาย่อเป็นต้น และสิทธิในการให้อนุญาตช่วงให้แก่บุคคลภายนอกในการทำงานร่วมกับ แอปพลิเคชัน บัญชีกลางเป็นต้น)",
    },
    {
        id: "9.7.",
        description: "ผู้ใช้ต้องไม่ใช้สิทธิของตน เช่น สิทธิทางศีลธรรมที่เกี่ยวข้องกับเนื้อหาจากผู้ใช้ในส่วนที่เกี่ยวกับการใช้งานโดยแอพพลิเคชั่นบัญชีกลาง หรือบุคคลภายนอก",
    },
    {
        id: "9.8.",
        description: "แอปพลิเคชัน บัญชีกลางอาจทำการตรวจสอบรายละเอียดและยืนยันเนื้อหาจากผู้ใช้ภายใต้ขอบเขตที่กฎหมายกำหนด หากแอปพลิเคชัน บัญชีกลางเห็นว่ามีความจำเป็นเพื่อที่จะปฏิบัติตามกฎหมาย ข้อบังคับ หรือข้อกำหนดและเงื่อนไขฯ ฉบับนี้  อย่างไรก็ตามแอปพลิเคชัน บัญชีกลางไม่มีภาระหน้าที่จะต้องดำเนินการตรวจสอบดังกล่าวแต่อย่างไร",
    },
    {
        id: "9.9.",
        description: "หาก แอปพลิเคชัน บัญชีกลางเห็นว่า ผู้ใช้ได้ฝ่าฝืนหรืออาจฝ่าฝืนกฎหมาย กฎระเบียบ หรือข้อกำหนดและเงื่อนไขฯ ฉบับนี้ ซึ่งเกี่ยวข้องกับเนื้อหาจากผู้ใช้ หรือเกี่ยวข้องกับการดำเนินกิจการของ แอปพลิเคชัน บัญชีกลาง เราขอสงวนสิทธิ์ที่จะตัดสิทธิผู้ใช้ในการที่ใช้เนื้อหาในบางลักษณะ เช่น การลบเนื้อหาจากผู้ใช้ โดยไม่ต้องบอกกล่าวล่วงหน้า เป็นต้น",
    },
]

export const Coin = [
    {
        id: "10.1.",
        description: "ผู้ใช้จะได้รับเหรียญโดยวิธีการที่ แอปพลิเคชัน บัญชีกลาง กำหนด เช่น การซื้อในระบบการให้บริการฯ การเสนอให้เป็นพิเศษ และวิธีการอื่นๆ ในทำนองเดียวกัน ทั้งนี้ รายละเอียดเกี่ยวกับค่าเงิน วิธีการชำระเงิน และเงื่อนไขอื่นๆ เกี่ยวกับการได้รับเหรียญจะถูกกำหนดและแสดงอยู่บนระบบการให้บริการฯ หรือบนเว็ปไซต์ของ แอปพลิเคชัน บัญชีกลาง",
    },
    {
        id: "10.2.",
        description: "เหรียญนั้นไม่สามารถนำไปแลกเปลี่ยนใช้แทนเงินหรือทรัพสิน หรือให้เพื่อวัตถุประสงค์ทางการเงินอื่นนอกจากที่บริการฯ และเนื้อหาของแอพพลิเคชั่นบัญชีกลาง กำหนดจำนวนเหรียญที่จำเป็นต่อการรับบริการฯ หรือใช้เพื่อเนื้อหา หรือใช้เพื่อสิ่งอื่นใดในทำนองเดียวกันจะถูกกำหนดและแสดงอยู่บนระบบการให้บริการฯ หรือบนเว็บไซต์ของแอพพลิเคชั่นบัญชีกลาง",
    },
    {
        id: "10.3.",
        description: "เฉพาะบัญชีที่รับเหรียญเท่านั้นที่จะสามารถใช้งานเหรียญได้ นอกจากนี้เหรียญที่ให้บริการโดยปลายทาง (เทอร์มินอล) ซึ่งมีระบบปฎิบัติการที่แตกต่างกันนั้นไม่สามารถนำมารวม หรือยกยอดเหรียญกันได้ เนื่องจากประเภทของเหรียญนั้นมีความแตกต่างกัน แม้ว่าเหรียญดังกล่าวจะถูกจัดประเภทให้อยู่ภายใต้ชื่อเดียวกันก็ตาม",
    },
    {
        id: "10.4.",
        description: "เหรียญนั้นสามารถขอคืนเป็นเงินได้โดยการกดถอนเงินเข้าบัญชีพร้อมเพย์ที่ระบุไว้กับแอปพลิเคชัน บัญชีกลาง อย่างไรก็ตาม ข้อกำหนดนี้จะไม่มีผลใช้บังคับหากมีกฎหมายและกฏระเบียบที่เกี่ยวข้องกำหนดว่าต้องคืนเงิน ในกรณีดังกล่าว แอปพลิเคชัน บัญชีกลางจะดำเนินการคืนเงินตามกฎหมายและกฏระเบียบที่เกี่ยวข้อง และจะมีการแสดงข้อมูลดังกล่าวไว้ในเว็บไซต์ของ แอปพลิเคชัน บัญชีกลาง และที่อื่นๆ ตามที่อาจกำหนดต่อไป",
    },
    {
        id: "10.5.",
        description: "ค่าตอบแทนแอพพลิเคชั่นบัญชีกลาง โดยบริษัท กลางหลักประกันออนไลน์ จำกัด คิดค่าตอบแทนการใช้เนื้อหาในแอพพลิเคชั่นดังนี้",
    },
    {
        id: "10.5.1.",
        description: "ค่าตอบแทนบริการบัญชีกลาง 15 บาทต่อรายการและค่าธรรมเนียมร้อยละ 0.50 ของยอดเงินที่ทำรายการค่าตอบแทน บริการบัญชีกลางและค่าธรรมเนียมสุทธิที่แสดงรามภาษีมูลค่าเพิ่มแล้ว",
    },
    {
        id: "10.5.2.",
        description: "ค่าตอบแทนบริการหลักประกันออนไลน์ รายละเอียดฉบับละ 300 บาท รวมภาษีมูลค่าเพิ่มแล้ว",
    }
]

export const Register = [
    {
        id: "11.1.",
        description: "ผู้ใช้อาจได้รับบริการฯ โดยมีค่าใช้จ่ายหรือค่าธรรมเนียม หรือได้รับบริการฯภายใต้ข้อกำหนด และเงื่อนไขของแอพพลิเคชั่นบัญชีกลาง ทั้งนี้ผู้ใช้อาจต้องชำระค่าบริการบางส่วน เพื่อใช้งานเนื้อหาหลักของแอพพลิเคชั่นบัญชีกลางภายในระยะเวลาที่กำหนด ('บริการสมัครสมาชิกฯ') ผู้ใช้จะต้องปฎิบัติตามข้อกำหนดและเงื่อนไขเหล่านี้ค่าธรรมเนียมสำหรับบริการสมัครสมาชิกฯ วิธีชำระเงิน และเงื่อนไขการใช้งานอื่นๆ ซึ่งถูกกำหนดและแสดงอยู่บนระบบการให้บริการฯ หรือบนเว็บไซต์ของแอพพลิเคชั่นบัญชีกลาง",
    },
    {
        id: "11.2.",
        description: "ผู้ใช้สามารถดำเนินการตามขั้นตอนเพื่อขอยกเลิกการให้บริการสมัครสมาชิกฯได้ตลอดเวลาอย่างไรก็จาม หากผู้ใช้ดำเนินตามขั้นตอนเพื่อขอยกเลิกการให้บริการฯดังกล่าวก่อนระยะเวลาการใช้งานที่กำหนด ผู้ใช้อาจไม่สามารถยกเลิกการซื้อบริการสมัครสมาชิกฯดังกล่าวได้ในกรณีนี้ ค่าธรรมเนียมซึ่งผู้ใช้ได้ชำระไปแล้วนั้นไม่สามารถขอเรียกรับเงินคืนได้ อย่างไรก็ตามข้อกำหนดนี้อาจไม่มีผลบังคับใช้หากมีกฎหมายให้อำนาจไว้เป้นอื่น",
    },
    {
        id: "11.3.",
        description: "ในกรณีที่ผู้ใช้ไม่สามารถดำเนินการยกเลิกบริการสมัครสมาชิกฯ ตามวันและเวลาที่กำหนด ระยะเวลาในการให้บริการสมัครสมาชิกฯ ของท่านอาจได้รับการต่ออายุโดยอัตโนมัติ ถึงแม้ว่าจะสิ้นสุดระยะเวลาใช้บริการสมัครสมาชิกดังกล่าวแล้วก็ตาม ทั้งนี้ เป็นไปตามเงื่อนไขที่ แอปพลิเคชัน บัญชีกลางกำหนด",
    },
]

export const Limit = [
    {
        id: "12.1.",
        description: "การกระทำที่ฝ่าฝืนกฎหมาย ข้อบังคับ คำพิพากษา มติ หรือคำสั่งศาล หรือมาตรการทางปกครองที่มีผลผูกพันทางกฎหมาย",
    },
    {
        id: "12.2.",
        description: "การกระทำที่ขัดต่อความสงบเรียบร้อย หรือศีลธรรมอันดีของประชาชน",
    },
    {
        id: "12.3.",
        description: "การกระทำที่ละเมิดสิทธิในทรัพย์สินทางปัญญา เช่น ลิขสิทธิ์ เครื่องหมายการค้าและสิทธิบัตร สิทธิในชื่อเสียง ความเป็นส่วนตัว และสิทธิอื่นๆ ทั้งหมดที่ได้รับตามกฎหมายหรือตามสัญญากับ แอปพลิเคชัน บัญชีกลาง และ/หรือบุคคลที่สาม",
    },
    {
        id: "12.4.",
        description: "",
    },
]